Tekla Open API Reference for Tekla Structures 2025
ModelObject.Equals Method
 Check if Identifiers of model objects are same.
 Namespace: Tekla.Structures.Model
 Assembly: Tekla.Structures.Model (in Tekla.Structures.Model.dll) Version: 2025.0.0-alpha00048669+a99462f17964bc42624ada6e8d316db2d795d226
Syntax
public bool Equals(
	ModelObject other
)
Public Function Equals (
	other As ModelObject
) As Boolean
Parameters
other
Type: Tekla.Structures.Model.ModelObject
The model object to be used in comparison.
Return Value
Type: Boolean
true if object Identifiers are the same, false otherwise,
Implements
IEquatable<T>.Equals(T)
See Also
Reference
ModelObject Class
Tekla.Structures.Model Namespace